# Exercício

In [25]:
import pandas as pd

**Arquivo Exercicio_Pandas_1.csv**
1. Carregue um arquivo CSV contendo dados de uma planilha e crie um DataFrame com o Pandas.

In [26]:
data = pd.read_csv('./../../Datasets/Exercicio_Pandas_1.csv', sep='\t')
display(data.shape, data.head())

(5, 3)

    Nome  Idade          Cidade
0  Alice     25       São Paulo
1    Bob     30  Rio de Janeiro
2  Carol     22  Belo Horizonte
3  David     27        Salvador
4    Eva     68    Porto Alegre

2. Exiba as primeiras linhas do DataFrame para verificar os dados que foram carregados.

In [27]:
data.head()

    Nome  Idade          Cidade
0  Alice     25       São Paulo
1    Bob     30  Rio de Janeiro
2  Carol     22  Belo Horizonte
3  David     27        Salvador
4    Eva     68    Porto Alegre

3. Verifique o número de linhas e colunas presentes no DataFrame.

In [28]:
data.shape

(5, 3)

4. Utilize o método `info()` para obter informações sobre os tipos de dados e a contagem de valores não nulos em cada coluna.

In [29]:
data.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 5 entries, 0 to 4
Data columns (total 3 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   Nome    5 non-null      object
 1   Idade   5 non-null      int64
 2   Cidade  5 non-null      object
dtypes: int64(1), object(2)
memory usage: 248.0+ bytes

5. Selecione uma coluna específica do DataFrame e exiba suas estatísticas básicas usando o método `describe()`.

In [30]:
data['Idade'].describe()

count     5.000000
mean     34.400000
std      19.007893
min      22.000000
25%      25.000000
50%      27.000000
75%      30.000000
max      68.000000
Name: Idade, dtype: float64

6. Faça uma filtragem no DataFrame para exibir apenas as linhas que atendam a determinada condição.

In [31]:
data[data.Idade>25]

    Nome  Idade          Cidade
1    Bob     30  Rio de Janeiro
3  David     27        Salvador
4    Eva     68    Porto Alegre

7. Crie uma nova coluna no DataFrame, calculando-a com base em outras colunas existentes.

In [32]:
data['Idade_2'] = data['Idade']*2
data

    Nome  Idade          Cidade  Idade_2
0  Alice     25       São Paulo       50
1    Bob     30  Rio de Janeiro       60
2  Carol     22  Belo Horizonte       44
3  David     27        Salvador       54
4    Eva     68    Porto Alegre      136

8. Agrupe o DataFrame com base em uma coluna específica e realize uma operação de agregação, como soma, média ou contagem.

In [33]:
# não há dados para agregar

9.  Utilize a função `apply()` para aplicar uma função personalizada a uma coluna ou linha do DataFrame.

In [34]:
def duplica_idade(idade_):
    return idade_ * 2

data['Idade'].apply(duplica_idade)

0     50
1     60
2     44
3     54
4    136
Name: Idade, dtype: int64

10. Faça uma ordenação dos dados em ordem crescente ou decrescente com base em uma coluna específica.

In [35]:
data.sort_values(by='Nome', ascending=False)

    Nome  Idade          Cidade  Idade_2
4    Eva     68    Porto Alegre      136
3  David     27        Salvador       54
2  Carol     22  Belo Horizonte       44
1    Bob     30  Rio de Janeiro       60
0  Alice     25       São Paulo       50

11. Utilize o recurso de indexação booleana para filtrar o DataFrame com base em várias condições.

In [36]:
data.set_index('Nome', inplace=True)
data.loc['Carol']

Idade                  22
Cidade     Belo Horizonte
Idade_2                44
Name: Carol, dtype: object

**Arquivo Exercicio_Pandas_2.json**
1.  Carregue um conjunto de dados complexo (por exemplo, de um arquivo JSON ou um banco de dados SQL) e crie um DataFrame usando o Pandas.

In [37]:
json_data = pd.read_json('./../../Datasets/Exercicio_Pandas_2.json')
display(json_data.shape, json_data.head())

(5, 4)

     Produto  Quantidade_Vendida  Valor_Unitario  Valor_Total
0    Celular                 100            1000       100000
1         TV                  50            2000       100000
2   Notebook                  70            2500       175000
3     Tablet                  30             800        24000
4  Headphone                  80             150        12000

2.  Utilize técnicas de indexação avançada para selecionar, filtrar e modificar dados em um DataFrame.

In [38]:
json_data[json_data.Valor_Unitario>json_data.Valor_Unitario.mean()]

    Produto  Quantidade_Vendida  Valor_Unitario  Valor_Total
1        TV                  50            2000       100000
2  Notebook                  70            2500       175000

   
**Arquivos Exercicio_Pandas_2.json e Exercicio_Pandas_3.csv**
1.  Combine dois DataFrames usando operações de junção (merge) ou concatenação.
   
2.  Utilize o método `groupby()` para agrupar os dados por múltiplas colunas e realizar operações de agregação em grupos.